#include <stdio.h>

int main(void)
{
    //运算优先级
    printf("-11%%5 = %d",-11%5);  //-1
    //取模实例
    //分离个位，百位
    printf("\n1232 = %d %d %d %d",1232/1000%10,1232/100%10,1232/10%10,1232%10);

    //main用作变量名也可
    int main = 0; 

    printf("%f",10/3.0*3);  //10.0

    int a,b;
    a=b=0;
    scanf(" %d %d \nabc",&a,&b); 
    //前面空格可不用输入 输入完后要再输入一个可见字符来完成
    /* 
    ：23 34
      s
    - 23 34

    ：23 
      34 s
    - 23 34   
     */
    printf("%d %d",a,b);

    //----------------------三位数颠倒--------------------
    int a2;
    scanf("%d",&a2);
    // /100 是100取百位以及百位之前的数字，%10 求个位
        printf("%d",a2/100 + a2/10%10 *10 + a2%10*100);
    // 先把数字安排到个位         再%10 提出来
    //或者a % 100 / 10 * 10
    //可以%前阶，或者/本阶

    //--------------------------数位数-------------------
    int x ,n;
    scanf("%d",&x);
    n= 1 ;
    x = x/10; 
    while (x >0)
    {
        n++;
        x /= 10;    //循环体要有改变循环判断的条件
    }
    
    printf("%d",n);

    //判断位数
    int x2 =1000;
    int n2 = 0;
    do{
        n2++;
        x2/=10;

    }while(x2 > 0);

    printf("%d",n2);
    //--------------------------------------------------------



    return 0;

}